{
    "url": "https://www.iso.org/standard/55477.html",
    "info": {
        "nav_elements": "ISO/IEC 25021:2012\n  Systems and software engineeringSystems and software Quality Requirements and Evaluation (SQuaRE)Quality measure elements",
        "price": {
            "currency": "CHF",
            "amount": "173"
        },
        "description": "ISO/IEC 25021:2012 provides guides to specify Quality Measure Elements (QME) and initial set of QME as examples. QME is a measure defined in terms of a property and the measurement method for quantifying it, including optionally the transformation by a mathematical function. ISO/IEC 25021:2012 is intended to be used throughout the system and software product life cycle used with other documents of the ISO/IEC 250nn SQuaRE series, especially ISO/IEC 25022, ISO/IEC 25023 and ISO/IEC 25024.",
        "link": "https://www.iso.org/obp/ui/en/#!iso:std:55477:en",
        "additional_content": "Foreword ISO (the International Organization for Standardization) and IEC (the International Electrotechnical Commission) form the specialized system for worldwide standardization. National bodies that are members of ISO or IEC participate in the development of International Standards through technical committees established by the respective organization to deal with particular fields of technical activity. ISO and IEC technical committees collaborate in fields of mutual interest. Other international organizations, governmental and non-governmental, in liaison with ISO and IEC, also take part in the work. In the field of information technology, ISO and IEC have established a joint technical committee, ISO/IEC JTC 1. International Standards are drafted in accordance with the rules given in the ISO/IEC Directives, Part 2. The main task of the joint technical committee is to prepare International Standards. Draft International Standards adopted by the joint technical committee are circulated to national bodies for voting. Publication as an International Standard requires approval by at least 75 % of the national bodies casting a vote. Attention is drawn to the possibility that some of the elements of this document may be the subject of patent rights. ISO and IEC shall not be held responsible for identifying any or all such patent rights. ISO/IEC 25021  was prepared by Joint Technical Committee ISO/IEC JTC 1,  Information technology , Subcommittee SC 7,  Software and System Engineering . This first edition of International Standard  ISO/IEC 25021  cancels and replaces the first edition of Technical Report  ISO/IEC TR 25021:2007 . The SQuaRE series of standards consists of the following divisions under the general title  Systems and Software Quality Requirements and Evaluation (SQuaRE) : ?  ISO/IEC 2500n,  Quality Management Division , ?  ISO/IEC 2501n,  Quality Model Division , ?  ISO/IEC 2502n,  Quality Measurement Division , ?  ISO/IEC 2503n,  Quality Requirements Division , and ?  ISO/IEC 2504n,  Quality Evaluation Division . Introduction The purpose of this International Standard is to define and/or design an initial set of Quality Measure Elements (QME) to be used throughout the product life cycle for the purpose of Systems and Software Quality Requirements and Evaluation (SQuaRE). The document also gives a set of rules to design a QME or verify the design of an existing QME. The content of this document constitutes the link between the  ISO/IEC 9126  series of standards and the subsequent SQuaRE series of standards. A number of QMEs for quality measures that quantify some of the characteristic and subcharacteristic represent an initial list, which is to be used during the construction of the quality measures as referenced in  ISO/IEC TR 9126-2 ,  ISO/IEC TR 9126-3  and  ISO/IEC TR 9126-4 . Quality measures presented in the SQuaRE series ( Figures 1 ,  2 ) were extracted from  ISO/IEC TR 9126  series but it is not the only source. When evaluating selected quality measures, the user should first understand the definition of each property related to a QME used within the selected quality measures. The main purposes of defining and using the Quality Measures Elements (QMEs) in this document are: ?  To provide guidance for organisations developing and implementing their own QMEs; ?  To promote the consistent use of specific QME for measuring and using the product properties that are relevant to different product quality characteristics and subcharacteristics; ?  To help identify a set of QMEs that are uniquely required to derive all the quality measures for a given set of characteristics or a set of subcharacteristics of a product. The QMEs are the common components of a number of quality measures. The intended usage of this International standard is that users will be able to select and define relevant valid QMEs to define internal, external, data or quality-in-use quality measures. Then, these can be used for quality requirements definition, products evaluation and quality assessment but not necessary limited to those. It is therefore recommended to use this document prior or together with the ISO/IEC 2502n series of standards. Figure 1 \n?\n Organisation of the SQuaRE series of international standards Figure 1  illustrates the organisation of the SQuaRE series representing families of standards, further called Divisions. Figure 2 \n?\n Structure of the Quality Measurement Division Figure 3 \n?\n The relationship of  ISO/IEC 25021  as a link between the 9126 series and the SQuaRE series of standard The  ISO/IEC 9126  series is composed of four documents that list and describe the characteristics, subcharacteristics and quality measures that are referred to as the quality model. The SQuaRE quality models categorize product quality into characteristics which are further subdivided into subcharacteristics and quality properties ( ISO/IEC 25010 ). Each quality measure within  ISO/IEC 9126  series is composed of at least two QMEs. The properties (of a product) are linked to the QME ( ISO/IEC 25020 ), using a measurement method. The 2502n series designs and describes quality measures and associated QMEs for all the quality (sub)characteristics in the quality model. 1   Scope This International Standard contains the following information: ?  Requirements for defining QMEs as part of the specification of the product quality requirements with examples (see  6.2 Tables 1  and  2 ); NOTE  Product quality includes system quality, software product quality, data quality and eventually system service quality. ?  An initial set of QMEs, as examples (see  Annex A Table A.1 ); ?  A guideline for defining and quantifying the property of the product (target entity) for QMEs (see  Annex B ) This document is intended for, but not limited to, developers, acquirers and independent evaluators of products, particularly those responsible for defining product quality requirements and for product evaluation. This International Standard is applicable when defining the QMEs to be used to implement quality measures such as those specified in ISO/IEC 25022, ISO/IEC 25023 and ISO/IEC 25024. Only informative sections of standards are publicly available. To view the full content, you will need to purchase the standard by clicking on the \"Buy\" button. 3   Normative references The following documents, in whole or in part, are normatively referenced in this document and are indispensable for its application. For dated references, only the edition cited applies. For undated references, the latest edition of the referenced document (including any amendments) applies. ISO/IEC 25000:2005 ,  Software engineering ? Software product Quality Requirements and Evaluation (SQuaRE) ? Guide to SQuaRE ISO/IEC 25010:2011 ,  Systems and software engineering ? Systems and software product Quality Requirements and Evaluation (SQuaRE) ? System and software quality models ISO/IEC 25020:2007 ,  Software engineering ? Software product Quality Requirements and Evaluation (SQuaRE) ? Measurement reference model and guide ISO/IEC 15939:2007 ,  Systems and software engineering ? Measurement process ISO/IEC Guide 99:2007 ,  International vocabulary of metrology ? Basic and general concepts and associated terms (VIM) 4   Terms and definitions For the purposes of this document, the terms and definitions given in  ISO/IEC 25000 ,  ISO/IEC 25010 ,  ISO/IEC 25020 ,  ISO/IEC 15939 ,  ISO/IEC Guide 99 , and the following apply. The following definitions are replicated here for the convenience of the user of this document. 4.1 data quality degree to which the characteristics of data satisfy stated and implied needs when used under specified conditions [SOURCE:ISO/IEC 25012:2008] 4.2 external measure of software quality measure of the degree to which a software product enables the behavior of a system to satisfy stated and implied needs for the system including the software to be used under specified conditions Note 1 to entry:  The behavior can be verified and/or validated by executing the software product during testing and operation. Note 2 to entry:  Based on the  ISO/IEC 25000:2005  definition of external software quality. Note 3 to entry:  This definition was adapted from  ISO/IEC 25010:2011 . 4.3 internal measure of software quality measure of the degree to which a set of static properties of a software product satisfies stated and implied needs for the software product to be used under specified conditions Note 1 to entry:  Static properties include those that relate to the software architecture, structure and its components. Note 2 to entry:  Static properties can be verified by review, inspection, simulation and/or automated tools. Note 3 to entry:  This definition was adapted from  ISO/IEC 25010:2011 . EXAMPLE: Depending of the context specifications faults, design faults and code faults could be used as internal quality measures. Note 4 to entry:  Based on the  ISO/IEC 25000:2005  definition of internal software quality. 4.4 measure (noun) variable to which a value is assigned as the result of measurement Note 1 to entry:  The term ?measures? is used to refer collectively to base measures, measures, and indicators. [SOURCE:ISO/IEC 15939:2007] 4.5 measure (verb) make a measurement [SOURCE:ISO/IEC 25000:2005] 4.6 measurement set of operations having the object of determining a value of a measure [SOURCE:ISO/IEC 15939:2007] Note 1 to entry:  Measurement can be nominal, ordinal, interval and ratio scale type. 4.7 measurement function algorithm or calculation performed to combine two or more quality measure elements Note 1 to entry:  This definition is modified from  ISO/IEC 15939:2007  definition of measurement method. 4.8 measurement method logical organisation of operations, described generically, used in measurement Note 1 to entry:  This definition is modified from  ISO/IEC 15939:2007  definition of measurement method. 4.9 measurement procedure logical organisation of operations, applied specifically, used in the performance of particular measurements according to a given measurement method Note 1 to entry:  This definition is modified from  ISO/IEC 15939:2007  definition of measurement procedure. Note 2 to entry:  A measurement procedure is usually recorded in a document that is sometimes itself called a \"measurement procedure\" and is usually in sufficient detail to enable an operator to carry out a measurement without additional information. 4.10 model specification of the concepts, relationships and rules that are used to define a methodology [SOURCE:ISO/IEC 24744:2007, Software Engineering ? Model for Development Methodologies] 4.11 property to quantify property of a target entity that is related to a quality measure element and which can be quantified by a measurement method Note 1 to entry:  A software artifact is an example of a target entity. Note 2 to entry:  A sub-property is related to a property. 4.12 quality in use measure measure of the degree to which a product or system can be used by specific users to meet their needs to achieve specific goals with effectiveness, efficiency, freedom from risk, satisfaction and context coverage in specific contexts of use Note 1 to entry:  Based on the  ISO/IEC 25010:2011  definition of quality in use. 4.13 quality measure derived measure that is defined as a measurement function of two or more values of quality measure elements 4.14 quality measure element QME measure defined in terms of a property and the measurement method for quantifying it, including optionally the transformation by a mathematical function 4.15 repeatability (of results of measurement) closeness of the agreement between the results of successive measurements of the same measurand carried out under the same conditions of measurement [SOURCE:ISO/IEC TR 14143-3:2003] 4.16 reproducibility (of results of measurement) closeness of the agreement between the results of measurements of the same measurand carried out under changed conditions of measurement [SOURCE:ISO/IEC TR 14143-3:2003] Note 1 to entry:  Repeatability and reproducibility may be expressed quantitatively in terms of the dispersion characteristics of the results. 4.17 target entity fundamental thing of relevance to the user, about which information is kept, and need to be measured 4.18 unit (of measure) a particular quantity defined and adopted by convention, with which other quantities of the same kind are compared in order to express their magnitude relative to that quantity Note 1 to entry:  Only quantities expressed in the same units of measurement are directly comparable. Examples of units include the number of faults and the number of failures. Hour and meter are also unit of measure. Note 2 to entry:  Units of measurement have conventionally assigned names and symbols. Note 3 to entry:  Based on the  ISO/IEC 25000:2005  definition of unit of measurement. Only informative sections of standards are publicly available. To view the full content, you will need to purchase the standard by clicking on the \"Buy\" button. Bibliography [1] ISO/IEC 25022,  Systems and software engineering -Systems and software Quality Requirements and Evaluation (SQuaRE) ? Measurement of quality in use (revision of ISO/IEC 9126-4)  (to be proposed) [2] ISO/IEC 25023,  Systems and software engineering -Systems and software Quality Requirements and Evaluation (SQuaRE) ? Measurement of system and software product quality (revision of ISO/IEC 9126-2  and 9126-3) (to be proposed) [3] ISO/IEC 25024,  Systems and software engineering -Systems and software Quality Requirements and Evaluation (SQuaRE) ? Measurement of data quality (to be proposed) [4] ISO/IEC 25042,  Systems and software engineering ? Systems and software product Quality Requirements and Evaluation (SQuaRE) ? Evaluation modules  (to be proposed) [5] ISO/IEC 25012:2008 ,  Software Engineering ? Software product Quality Requirements and Evaluation (SQuaRE) ? Data quality model [6] ISO/IEC TR 9126-2 ,  Software engineering ? Product quality ? Part 2: External metrics  [Technical Report] [7] ISO/IEC TR 9126-3 ,  Software engineering ? Product quality ? Part 3: Internal metrics  [Technical Report] [8] ISO/IEC TR 9126-4 ,  Software engineering ? Product quality ? Part 4: Quality in use metrics  [Technical Report] [9] ISO/IEC Guide 99:2007 ,  International vocabulary of metrology ? Basic and general concepts and associated terms (VIM) [10] ISO/IEC/IEEE 24765:2010 ,  Systems and software engineering vocabulary [11] ISO/IEC 12207:2008 ,  Systems and Software Engineering ? Software Life Cycle Processes [12] ISO/IEC 15288:2008 ,  Systems and Software Engineering ? System Life Cycle Processes [13] ISO/IEC 14143-1:2007 ,  Information technology ? Software measurement ? Functional size measurement [14] IEEE 1061-1998 (R2004),  IEEE Standard for Software Quality Metrics Methodology [15] IEEE 1012-2004,  IEEE Standard for Software Verification and Validation [16] PMI (Project Management Institute): 2008, A Guide to the Project Management Body of Knowledge (PMBOK® Guide) ? Fourth Edition [17] Desharnais, J-M. , Abran A., Suryn W., ?Attributes and Related Base Measures within ISO 9126: A Pareto Analysis?, Software Quality Management 2009 and INSPIRE 2009 Conferences, British Computer Society, April 2009. [18] Advanced Research Project on Software Metrics by Ministry of Economy, Trade and Industry, Japan -Investigative Report on Measure for System/Software Product Quality Requirement Definition and Evaluation 2011 1 For the definitions see c) (objectives and properties to quantify) and g) (definition of each sub-properties). © 2012 ISO/IEC ? All rights reserved"
    }
}
